Revit 2027 API
RebarContainer.PresentItemsAsSubelements Property
 Identifies if Items should be presented in schedules and tags as separate subelements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool PresentItemsAsSubelements { get; set; }
Public Property PresentItemsAsSubelements As Boolean
	Get
	Set
public:
property bool PresentItemsAsSubelements {
	bool get ();
	void set (bool value);
}
member PresentItemsAsSubelements : bool with get, set
Property Value
Boolean
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace